
  #### Terraform Plan Validate All 📖: `success`
  Plan File: `tmp_plan/envs-shared.plan`

  <details><summary>Show Plan</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.kms.google_kms_crypto_key.key[0] has changed
  ~ resource "google_kms_crypto_key" "key" {
        id                            = "projects/prj-c-sccn-r6k7/locations/northamerica-northeast1/keyRings/krg-cai-monitoring/cryptoKeys/key-cai-monitoring"
      + labels                        = {}
        name                          = "key-cai-monitoring"
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.base_network_hub[0].module.budget.google_billing_budget.budget[0] has changed
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/4d0dfcae-6e19-4d93-b1f0-c95b088296dd"
        name            = "4d0dfcae-6e19-4d93-b1f0-c95b088296dd"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          + resource_ancestors     = []
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.cai_monitoring.module.pubsub_cai_feed.google_pubsub_topic.topic[0] has changed
  ~ resource "google_pubsub_topic" "topic" {
        id           = "projects/prj-c-sccn-r6k7/topics/top-cai-monitoring-a3a0-event"
      + labels       = {}
        name         = "top-cai-monitoring-a3a0-event"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dns_hub.module.budget.google_billing_budget.budget[0] has changed
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/144e835a-bfa3-4972-9ff4-3a086873c4af"
        name            = "144e835a-bfa3-4972-9ff4-3a086873c4af"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          + resource_ancestors     = []
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.interconnect.module.budget.google_billing_budget.budget[0] has changed
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/49c6cab9-c3e1-49dd-be4f-bfa4c21b2dd4"
        name            = "49c6cab9-c3e1-49dd-be4f-bfa4c21b2dd4"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          + resource_ancestors     = []
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.logs_export.module.destination_pubsub[0].google_pubsub_subscription.pubsub_subscription[0] has changed
  ~ resource "google_pubsub_subscription" "pubsub_subscription" {
        id                           = "projects/prj-c-logging-coqt/subscriptions/tp-org-logs-tmqd-subscription"
      + labels                       = {}
        name                         = "tp-org-logs-tmqd-subscription"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.logs_export.module.destination_pubsub[0].google_pubsub_topic.topic has changed
  ~ resource "google_pubsub_topic" "topic" {
        id      = "projects/prj-c-logging-coqt/topics/tp-org-logs-tmqd"
      + labels  = {}
        name    = "tp-org-logs-tmqd"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.org_audit_logs.module.budget.google_billing_budget.budget[0] has changed
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/698fe19a-d669-47d8-9cb3-03699d537e19"
        name            = "698fe19a-d669-47d8-9cb3-03699d537e19"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          + resource_ancestors     = []
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.org_billing_logs.module.budget.google_billing_budget.budget[0] has changed
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/e1b9eac3-68d6-4963-8dbe-c3468b485463"
        name            = "e1b9eac3-68d6-4963-8dbe-c3468b485463"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          + resource_ancestors     = []
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.org_kms.module.budget.google_billing_budget.budget[0] has changed
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/d424185b-8d57-4cf3-bc8b-caccb3f61b09"
        name            = "d424185b-8d57-4cf3-bc8b-caccb3f61b09"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          + resource_ancestors     = []
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.org_secrets.module.budget.google_billing_budget.budget[0] has changed
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/fa7ef0b3-52fb-40e4-9cb0-6709cd91b2da"
        name            = "fa7ef0b3-52fb-40e4-9cb0-6709cd91b2da"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          + resource_ancestors     = []
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.scc_notifications.module.budget.google_billing_budget.budget[0] has changed
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/be5fd03f-ca66-455e-8454-2c0b7d3a70bc"
        name            = "be5fd03f-ca66-455e-8454-2c0b7d3a70bc"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          + resource_ancestors     = []
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.base_restricted_environment_network["development"].module.base_shared_vpc_host_project.module.budget.google_billing_budget.budget[0] has changed
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/3af0e53d-7274-4cce-a151-d6eacb8d9404"
        name            = "3af0e53d-7274-4cce-a151-d6eacb8d9404"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          + resource_ancestors     = []
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.base_restricted_environment_network["nonproduction"].module.base_shared_vpc_host_project.module.budget.google_billing_budget.budget[0] has changed
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/c4ec84e7-f7a6-4e37-868c-d11d5c1b551e"
        name            = "c4ec84e7-f7a6-4e37-868c-d11d5c1b551e"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          + resource_ancestors     = []
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.base_restricted_environment_network["production"].module.base_shared_vpc_host_project.module.budget.google_billing_budget.budget[0] has changed
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/113923ba-e15c-48fb-99c4-0bba2b18ff3b"
        name            = "113923ba-e15c-48fb-99c4-0bba2b18ff3b"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          + resource_ancestors     = []
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # time_sleep.wait_logs_export will be created
  + resource "time_sleep" "wait_logs_export" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.logs_export.google_project_iam_member.project_sink_member["resource"] will be created
  + resource "google_project_iam_member" "project_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-folder-676704635797@gcp-sa-logging.iam.gserviceaccount.com"
      + project = "prj-c-logging-coqt"
      + role    = "roles/logging.logWriter"
    }

  # module.logs_export.google_pubsub_topic_iam_member.pubsub_sink_member["resource"] will be created
  + resource "google_pubsub_topic_iam_member" "pubsub_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prj-c-logging-coqt"
      + role    = "roles/pubsub.publisher"
      + topic   = "tp-org-logs-tmqd"
    }

  # module.logs_export.google_pubsub_topic_iam_member.pubsub_sink_member_billing[0] must be replaced
-/+ resource "google_pubsub_topic_iam_member" "pubsub_sink_member_billing" {
      ~ etag    = "BwYurlXjEKc=" -> (known after apply)
      ~ id      = "projects/prj-c-logging-coqt/topics/tp-org-logs-tmqd/roles/pubsub.publisher/serviceAccount:service-b-01f01c-ec0bac-dd9482@gcp-sa-logging.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:service-b-01F01C-EC0BAC-DD9482@gcp-sa-logging.iam.gserviceaccount.com" -> (known after apply) # forces replacement
      ~ topic   = "projects/prj-c-logging-coqt/topics/tp-org-logs-tmqd" -> "tp-org-logs-tmqd"
        # (2 unchanged attributes hidden)
    }

  # module.logs_export.google_storage_bucket_iam_member.storage_sink_member["resource"] will be created
  + resource "google_storage_bucket_iam_member" "storage_sink_member" {
      + bucket = "bkt-prj-c-logging-coqt-org-logs-tmqd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectCreator"
    }

  # module.logs_export.google_storage_bucket_iam_member.storage_sink_member_billing[0] must be replaced
-/+ resource "google_storage_bucket_iam_member" "storage_sink_member_billing" {
      ~ bucket = "b/bkt-prj-c-logging-coqt-org-logs-tmqd" -> "bkt-prj-c-logging-coqt-org-logs-tmqd"
      ~ etag   = "CAI=" -> (known after apply)
      ~ id     = "b/bkt-prj-c-logging-coqt-org-logs-tmqd/roles/storage.objectCreator/serviceAccount:service-b-01f01c-ec0bac-dd9482@gcp-sa-logging.iam.gserviceaccount.com" -> (known after apply)
      ~ member = "serviceAccount:service-b-01F01C-EC0BAC-DD9482@gcp-sa-logging.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.org_domain_restricted_sharing.data.google_organization.orgs["kubeshot.com"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_organization" "orgs" {
      + create_time           = (known after apply)
      + directory_customer_id = (known after apply)
      + domain                = "kubeshot.com"
      + id                    = (known after apply)
      + lifecycle_state       = (known after apply)
      + name                  = (known after apply)
      + org_id                = (known after apply)
    }

  # module.cai_monitoring.module.cloud_function.google_cloudfunctions2_function.function will be updated in-place
  ~ resource "google_cloudfunctions2_function" "function" {
        id          = "projects/prj-c-sccn-r6k7/locations/northamerica-northeast1/functions/caiMonitoring"
        name        = "caiMonitoring"
        # (8 unchanged attributes hidden)

      ~ service_config {
          ~ environment_variables            = {
              - "LOG_EXECUTION_ID" = "true" -> null
                # (2 unchanged elements hidden)
            }
            # (11 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.logs_export.module.destination_project[0].google_project_iam_member.log_sink_member will be created
  + resource "google_project_iam_member" "log_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-folder-676704635797@gcp-sa-logging.iam.gserviceaccount.com"
      + project = "prj-c-logging-coqt"
      + role    = "roles/logging.logWriter"
    }

  # module.logs_export.module.destination_pubsub[0].google_pubsub_topic_iam_member.pubsub_sink_member will be created
  + resource "google_pubsub_topic_iam_member" "pubsub_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prj-c-logging-coqt"
      + role    = "roles/pubsub.publisher"
      + topic   = "tp-org-logs-tmqd"
    }

  # module.logs_export.module.destination_storage[0].google_storage_bucket_iam_member.storage_sink_member will be created
  + resource "google_storage_bucket_iam_member" "storage_sink_member" {
      + bucket = "bkt-prj-c-logging-coqt-org-logs-tmqd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectCreator"
    }

  # module.logs_export.module.log_export["676704635797_pub"].google_logging_folder_sink.sink[0] will be created
  + resource "google_logging_folder_sink" "sink" {
      + destination      = "pubsub.googleapis.com/projects/prj-c-logging-coqt/topics/tp-org-logs-tmqd"
      + disabled         = false
      + filter           = <<-EOT
                logName: /logs/cloudaudit.googleapis.com%2Factivity OR
                logName: /logs/cloudaudit.googleapis.com%2Fsystem_event OR
                logName: /logs/cloudaudit.googleapis.com%2Fdata_access OR
                logName: /logs/cloudaudit.googleapis.com%2Faccess_transparency OR
                logName: /logs/cloudaudit.googleapis.com%2Fpolicy OR
                logName: /logs/compute.googleapis.com%2Fvpc_flows OR
                logName: /logs/compute.googleapis.com%2Ffirewall OR
                logName: /logs/dns.googleapis.com%2Fdns_queries
        EOT
      + folder           = "676704635797"
      + id               = (known after apply)
      + include_children = true
      + name             = "sk-c-logging-pub0"
      + writer_identity  = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.logs_export.module.log_export["676704635797_sto"].google_logging_folder_sink.sink[0] will be created
  + resource "google_logging_folder_sink" "sink" {
      + destination      = "storage.googleapis.com/bkt-prj-c-logging-coqt-org-logs-tmqd"
      + disabled         = false
      + filter           = <<-EOT
                logName: /logs/cloudaudit.googleapis.com%2Factivity OR
                logName: /logs/cloudaudit.googleapis.com%2Fsystem_event OR
                logName: /logs/cloudaudit.googleapis.com%2Fdata_access OR
                logName: /logs/cloudaudit.googleapis.com%2Faccess_transparency OR
                logName: /logs/cloudaudit.googleapis.com%2Fpolicy OR
                logName: /logs/compute.googleapis.com%2Fvpc_flows OR
                logName: /logs/compute.googleapis.com%2Ffirewall OR
                logName: /logs/dns.googleapis.com%2Fdns_queries
        EOT
      + folder           = "676704635797"
      + id               = (known after apply)
      + include_children = true
      + name             = "sk-c-logging-bkt0"
      + writer_identity  = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.logs_export.module.log_export_billing["pub"].google_logging_billing_account_sink.sink[0] must be replaced
-/+ resource "google_logging_billing_account_sink" "sink" {
      ~ id              = "billingAccounts/01F01C-EC0BAC-DD9482/sinks/sk-c-logging-pub-billing-4ant" -> (known after apply)
      ~ name            = "sk-c-logging-pub-billing-4ant" -> "sk-c-logging-pub0-billing-4ant" # forces replacement
      ~ writer_identity = "serviceAccount:service-b-01F01C-EC0BAC-DD9482@gcp-sa-logging.iam.gserviceaccount.com" -> (known after apply)
        # (3 unchanged attributes hidden)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.logs_export.module.log_export_billing["sto"].google_logging_billing_account_sink.sink[0] must be replaced
-/+ resource "google_logging_billing_account_sink" "sink" {
      ~ id              = "billingAccounts/01F01C-EC0BAC-DD9482/sinks/sk-c-logging-bkt-billing-4ant" -> (known after apply)
      ~ name            = "sk-c-logging-bkt-billing-4ant" -> "sk-c-logging-bkt0-billing-4ant" # forces replacement
      ~ writer_identity = "serviceAccount:service-b-01F01C-EC0BAC-DD9482@gcp-sa-logging.iam.gserviceaccount.com" -> (known after apply)
        # (3 unchanged attributes hidden)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.org_domain_restricted_sharing.module.allowed-policy-member-domains.google_folder_organization_policy.folder_policy_list_allow_values[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_list_allow_values" {
      + constraint  = "constraints/iam.allowedPolicyMemberDomains"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = (known after apply)
            }
        }
    }

  # module.base_restricted_environment_network["development"].module.base_shared_vpc_host_project.module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-dev-shared-base-3b6l"
      + skip_delete         = (known after apply)
    }

  # module.base_restricted_environment_network["development"].module.base_shared_vpc_host_project.module.budget.google_billing_budget.budget[0] will be updated in-place
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/3af0e53d-7274-4cce-a151-d6eacb8d9404"
        name            = "3af0e53d-7274-4cce-a151-d6eacb8d9404"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          ~ projects               = [
              - "projects/534908224893",
            ] -> (known after apply)
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.base_restricted_environment_network["nonproduction"].module.base_shared_vpc_host_project.module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-np-shared-base-y7i5"
      + skip_delete         = (known after apply)
    }

  # module.base_restricted_environment_network["nonproduction"].module.base_shared_vpc_host_project.module.budget.google_billing_budget.budget[0] will be updated in-place
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/c4ec84e7-f7a6-4e37-868c-d11d5c1b551e"
        name            = "c4ec84e7-f7a6-4e37-868c-d11d5c1b551e"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          ~ projects               = [
              - "projects/839319014061",
            ] -> (known after apply)
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.base_restricted_environment_network["production"].module.base_shared_vpc_host_project.module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-prod-shared-base-4uv0"
      + skip_delete         = (known after apply)
    }

  # module.base_restricted_environment_network["production"].module.base_shared_vpc_host_project.module.budget.google_billing_budget.budget[0] will be updated in-place
  ~ resource "google_billing_budget" "budget" {
        id              = "billingAccounts/01F01C-EC0BAC-DD9482/budgets/113923ba-e15c-48fb-99c4-0bba2b18ff3b"
        name            = "113923ba-e15c-48fb-99c4-0bba2b18ff3b"
        # (2 unchanged attributes hidden)

      ~ budget_filter {
          ~ projects               = [
              - "projects/532643676745",
            ] -> (known after apply)
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.base_restricted_environment_network["production"].module.base_shared_vpc_host_project.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + disabled     = false
      + display_name = "prj-prod-shared-base Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "prj-prod-shared-base-4uv0"
      + unique_id    = (known after apply)
    }

Plan: 15 to add, 4 to change, 4 to destroy.

Changes to Outputs:
  ~ billing_sink_names  = {
      ~ pub = "sk-c-logging-pub-billing-4ant" -> "sk-c-logging-pub0-billing-4ant"
      ~ sto = "sk-c-logging-bkt-billing-4ant" -> "sk-c-logging-bkt0-billing-4ant"
        # (1 unchanged element hidden)
    }
  + shared_vpc_projects = {
      + development   = {
          + base_shared_vpc_project_id           = "prj-dev-shared-base-3b6l"
          + base_shared_vpc_project_number       = "534908224893"
          + restricted_shared_vpc_project_id     = null
          + restricted_shared_vpc_project_number = null
        }
      + nonproduction = {
          + base_shared_vpc_project_id           = "prj-np-shared-base-y7i5"
          + base_shared_vpc_project_number       = "839319014061"
          + restricted_shared_vpc_project_id     = null
          + restricted_shared_vpc_project_number = null
        }
      + production    = {
          + base_shared_vpc_project_id           = "prj-prod-shared-base-4uv0"
          + base_shared_vpc_project_number       = "532643676745"
          + restricted_shared_vpc_project_id     = null
          + restricted_shared_vpc_project_number = null
        }
    }

  ```

  </details>
  
  